---
kind: property
id: P:Autodesk.Revit.DB.SpecTypeId.ElectricalPowerDensity
source: html/f87747d9-5719-7403-da5c-c3aa0e677625.htm
---
# Autodesk.Revit.DB.SpecTypeId.ElectricalPowerDensity Property

Power Density, in discipline Electrical.

## Syntax (C#)
```csharp
public static ForgeTypeId ElectricalPowerDensity { get; }
```